---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.CableTraySizes
source: html/9c5d6726-886e-d6ff-915a-026675cd1a99.htm
---
# CableTraySizes Methods

Inserts a new MEPSize into the cable tray sizes.
 For cable tray, the nominal diameter of MEPSize is used .